src/100_user_unified_postgres9_2.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 100
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            5140646
        write:                           1444641
        other:                           746305
        total:                           7331592
    transactions:                        361128 (6001.00 per sec.)
    queries:                             7331592 (121831.89 per sec.)
    ignored errors:                      6061   (100.72 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.1751s
    total number of events:              361128

Latency (ms):
         min:                                    0.97
         avg:                                   16.65
         max:                                 2982.20
         95th percentile:                       17.95
         sum:                              6013631.72

Threads fairness:
    events (avg/stddev):           3611.2800/38.31
    execution time (avg/stddev):   60.1363/0.01

sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 100
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            5939794
        write:                           1659303
        other:                           867513
        total:                           8466610
    transactions:                        414884 (6840.08 per sec.)
    queries:                             8466610 (139586.76 per sec.)
    ignored errors:                      9387   (154.76 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.6514s
    total number of events:              414884

Latency (ms):
         min:                                    1.12
         avg:                                   14.61
         max:                                 2023.74
         95th percentile:                       18.28
         sum:                              6060673.62

Threads fairness:
    events (avg/stddev):           4148.8400/33.78
    execution time (avg/stddev):   60.6067/0.01

sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 100
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            6018810
        write:                           1689419
        other:                           874785
        total:                           8583014
    transactions:                        422287 (6944.09 per sec.)
    queries:                             8583014 (141139.07 per sec.)
    ignored errors:                      7628   (125.43 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.8097s
    total number of events:              422287

Latency (ms):
         min:                                    1.05
         avg:                                   14.39
         max:                                 1108.85
         95th percentile:                       17.95
         sum:                              6076226.81

Threads fairness:
    events (avg/stddev):           4222.8700/27.58
    execution time (avg/stddev):   60.7623/0.08

sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 100
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            5048680
        write:                           1416731
        other:                           733816
        total:                           7199227
    transactions:                        354054 (5898.53 per sec.)
    queries:                             7199227 (119939.02 per sec.)
    ignored errors:                      6566   (109.39 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0227s
    total number of events:              354054

Latency (ms):
         min:                                    1.14
         avg:                                   16.95
         max:                                 5074.77
         95th percentile:                       19.65
         sum:                              6000110.98

Threads fairness:
    events (avg/stddev):           3540.5400/30.12
    execution time (avg/stddev):   60.0011/0.00

sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 100
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            5298748
        write:                           1486926
        other:                           770479
        total:                           7556153
    transactions:                        371760 (6193.79 per sec.)
    queries:                             7556153 (125890.93 per sec.)
    ignored errors:                      6722   (111.99 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0206s
    total number of events:              371760

Latency (ms):
         min:                                    1.17
         avg:                                   16.14
         max:                                 2076.09
         95th percentile:                       20.74
         sum:                              5999893.65

Threads fairness:
    events (avg/stddev):           3717.6000/30.68
    execution time (avg/stddev):   59.9989/0.00

sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 100
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            5345816
        write:                           1493908
        other:                           780323
        total:                           7620047
    transactions:                        373444 (6222.33 per sec.)
    queries:                             7620047 (126965.36 per sec.)
    ignored errors:                      8400   (139.96 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0159s
    total number of events:              373444

Latency (ms):
         min:                                    1.27
         avg:                                   16.07
         max:                                 1346.38
         95th percentile:                       21.11
         sum:                              5999721.42

Threads fairness:
    events (avg/stddev):           3734.4400/37.15
    execution time (avg/stddev):   59.9972/0.00

sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 100
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            5190402
        write:                           1455659
        other:                           755013
        total:                           7401074
    transactions:                        363868 (6062.45 per sec.)
    queries:                             7401074 (123310.19 per sec.)
    ignored errors:                      6875   (114.55 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0191s
    total number of events:              363868

Latency (ms):
         min:                                    1.26
         avg:                                   16.49
         max:                                 2009.60
         95th percentile:                       21.11
         sum:                              5999921.43

Threads fairness:
    events (avg/stddev):           3638.6800/32.11
    execution time (avg/stddev):   59.9992/0.00

sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 100
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            5508314
        write:                           1539245
        other:                           804080
        total:                           7851639
    transactions:                        384779 (6411.05 per sec.)
    queries:                             7851639 (130821.25 per sec.)
    ignored errors:                      8672   (144.49 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0172s
    total number of events:              384779

Latency (ms):
         min:                                    1.30
         avg:                                   15.59
         max:                                 1192.23
         95th percentile:                       20.37
         sum:                              5999666.89

Threads fairness:
    events (avg/stddev):           3847.7900/29.19
    execution time (avg/stddev):   59.9967/0.00

sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 100
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            5716676
        write:                           1596192
        other:                           835308
        total:                           8148176
    transactions:                        399094 (6648.61 per sec.)
    queries:                             8148176 (135742.48 per sec.)
    ignored errors:                      9240   (153.93 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0259s
    total number of events:              399094

Latency (ms):
         min:                                    1.34
         avg:                                   15.03
         max:                                 1084.10
         95th percentile:                       20.74
         sum:                              6000269.69

Threads fairness:
    events (avg/stddev):           3990.9400/27.02
    execution time (avg/stddev):   60.0027/0.00

sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 100
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            5962180
        write:                           1675473
        other:                           865684
        total:                           8503337
    transactions:                        418844 (6978.29 per sec.)
    queries:                             8503337 (141672.76 per sec.)
    ignored errors:                      7026   (117.06 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0201s
    total number of events:              418844

Latency (ms):
         min:                                    1.11
         avg:                                   14.32
         max:                                 1112.63
         95th percentile:                       20.74
         sum:                              5999861.30

Threads fairness:
    events (avg/stddev):           4188.4400/29.24
    execution time (avg/stddev):   59.9986/0.00